OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f95j94.h
#define _S56C1                  0x01
#define _S57C1                  0x02
#define _S58C1                  0x04
#define _S59C1                  0x08
#define _S60C1                  0x10
#define _S61C1                  0x20
#define _S62C1                  0x40
#define _S63C1                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA16 Bits

extern __at(0x0E9E) __sfr LCDDATA16;

typedef struct
  {
  unsigned S00C2                : 1;
  unsigned S01C2                : 1;
  unsigned S02C2                : 1;
  unsigned S03C2                : 1;
  unsigned S04C2                : 1;
  unsigned S05C2                : 1;
  unsigned S06C2                : 1;
  unsigned S07C2                : 1;
  } __LCDDATA16bits_t;

extern __at(0x0E9E) volatile __LCDDATA16bits_t LCDDATA16bits;

#define _S00C2                  0x01
#define _S01C2                  0x02
#define _S02C2                  0x04
#define _S03C2                  0x08
#define _S04C2                  0x10
#define _S05C2                  0x20
#define _S06C2                  0x40
#define _S07C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA17 Bits

extern __at(0x0E9F) __sfr LCDDATA17;

typedef struct
  {
  unsigned S08C2                : 1;
  unsigned S09C2                : 1;
  unsigned S10C2                : 1;
  unsigned S11C2                : 1;
  unsigned S12C2                : 1;
  unsigned S13C2                : 1;
  unsigned S14C2                : 1;
  unsigned S15C2                : 1;
  } __LCDDATA17bits_t;

extern __at(0x0E9F) volatile __LCDDATA17bits_t LCDDATA17bits;

#define _S08C2                  0x01
#define _S09C2                  0x02
#define _S10C2                  0x04
#define _S11C2                  0x08
#define _S12C2                  0x10
#define _S13C2                  0x20
#define _S14C2                  0x40
#define _S15C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA18 Bits

extern __at(0x0EA0) __sfr LCDDATA18;

typedef struct
  {
  unsigned S16C2                : 1;
  unsigned S17C2                : 1;
  unsigned S18C2                : 1;
  unsigned S19C2                : 1;
  unsigned S20C2                : 1;
  unsigned S21C2                : 1;
  unsigned S22C2                : 1;
  unsigned S23C2                : 1;
  } __LCDDATA18bits_t;

extern __at(0x0EA0) volatile __LCDDATA18bits_t LCDDATA18bits;

#define _S16C2                  0x01
#define _S17C2                  0x02
#define _S18C2                  0x04
#define _S19C2                  0x08
#define _S20C2                  0x10
#define _S21C2                  0x20
#define _S22C2                  0x40
#define _S23C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA19 Bits

extern __at(0x0EA1) __sfr LCDDATA19;

typedef struct
  {
  unsigned S24C2                : 1;
  unsigned S25C2                : 1;
  unsigned S26C2                : 1;
  unsigned S27C2                : 1;
  unsigned S28C2                : 1;
  unsigned S29C2                : 1;
  unsigned S30C2                : 1;
  unsigned S31C2                : 1;
  } __LCDDATA19bits_t;

extern __at(0x0EA1) volatile __LCDDATA19bits_t LCDDATA19bits;

#define _S24C2                  0x01
#define _S25C2                  0x02
#define _S26C2                  0x04
#define _S27C2                  0x08
#define _S28C2                  0x10
#define _S29C2                  0x20
#define _S30C2                  0x40
#define _S31C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA20 Bits

extern __at(0x0EA2) __sfr LCDDATA20;

typedef struct
  {
  unsigned S32C2                : 1;
  unsigned S33C2                : 1;
  unsigned S34C2                : 1;
  unsigned S35C2                : 1;
  unsigned S36C2                : 1;
  unsigned S37C2                : 1;
  unsigned S38C2                : 1;
  unsigned S39C2                : 1;
  } __LCDDATA20bits_t;

extern __at(0x0EA2) volatile __LCDDATA20bits_t LCDDATA20bits;

#define _S32C2                  0x01
#define _S33C2                  0x02
#define _S34C2                  0x04
#define _S35C2                  0x08
#define _S36C2                  0x10
#define _S37C2                  0x20
#define _S38C2                  0x40
#define _S39C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA21 Bits

extern __at(0x0EA3) __sfr LCDDATA21;

typedef struct
  {
  unsigned S40C2                : 1;
  unsigned S41C2                : 1;
  unsigned S42C2                : 1;
  unsigned S43C2                : 1;
  unsigned S44C2                : 1;
  unsigned S45C2                : 1;
  unsigned S46C2                : 1;
  unsigned S47C2                : 1;
  } __LCDDATA21bits_t;

extern __at(0x0EA3) volatile __LCDDATA21bits_t LCDDATA21bits;

#define _S40C2                  0x01
#define _S41C2                  0x02
#define _S42C2                  0x04
#define _S43C2                  0x08
#define _S44C2                  0x10
#define _S45C2                  0x20
#define _S46C2                  0x40
#define _S47C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA22 Bits

