OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f95j94.h
#define _S48C7                  0x01
#define _S49C7                  0x02
#define _S50C7                  0x04
#define _S51C7                  0x08
#define _S52C7                  0x10
#define _S53C7                  0x20
#define _S54C7                  0x40
#define _S55C7                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA63 Bits

extern __at(0x0ECD) __sfr LCDDATA63;

typedef struct
  {
  unsigned S56C7                : 1;
  unsigned S57C7                : 1;
  unsigned S58C7                : 1;
  unsigned S59C7                : 1;
  unsigned S60C7                : 1;
  unsigned S61C7                : 1;
  unsigned S62C7                : 1;
  unsigned S63C7                : 1;
  } __LCDDATA63bits_t;

extern __at(0x0ECD) volatile __LCDDATA63bits_t LCDDATA63bits;

#define _S56C7                  0x01
#define _S57C7                  0x02
#define _S58C7                  0x04
#define _S59C7                  0x08
#define _S60C7                  0x10
#define _S61C7                  0x20
#define _S62C7                  0x40
#define _S63C7                  0x80

//==============================================================================


//==============================================================================
//        LCDSE0 Bits

extern __at(0x0ECE) __sfr LCDSE0;

typedef struct
  {
  unsigned SE00                 : 1;
  unsigned SE01                 : 1;
  unsigned SE02                 : 1;
  unsigned SE03                 : 1;
  unsigned SE04                 : 1;
  unsigned SE05                 : 1;
  unsigned SE06                 : 1;
  unsigned SE07                 : 1;
  } __LCDSE0bits_t;

extern __at(0x0ECE) volatile __LCDSE0bits_t LCDSE0bits;

#define _SE00                   0x01
#define _SE01                   0x02
#define _SE02                   0x04
#define _SE03                   0x08
#define _SE04                   0x10
#define _SE05                   0x20
#define _SE06                   0x40
#define _SE07                   0x80

//==============================================================================


//==============================================================================
//        LCDSE1 Bits

extern __at(0x0ECF) __sfr LCDSE1;

typedef struct
  {
  unsigned SE08                 : 1;
  unsigned SE09                 : 1;
  unsigned SE10                 : 1;
  unsigned SE11                 : 1;
  unsigned SE12                 : 1;
  unsigned SE13                 : 1;
  unsigned SE14                 : 1;
  unsigned SE15                 : 1;
  } __LCDSE1bits_t;

extern __at(0x0ECF) volatile __LCDSE1bits_t LCDSE1bits;

#define _SE08                   0x01
#define _SE09                   0x02
#define _SE10                   0x04
#define _SE11                   0x08
#define _SE12                   0x10
#define _SE13                   0x20
#define _SE14                   0x40
#define _SE15                   0x80

//==============================================================================


//==============================================================================
//        LCDSE2 Bits

extern __at(0x0ED0) __sfr LCDSE2;

typedef struct
  {
  unsigned SE16                 : 1;
  unsigned SE17                 : 1;
  unsigned SE18                 : 1;
  unsigned SE19                 : 1;
  unsigned SE20                 : 1;
  unsigned SE21                 : 1;
  unsigned SE22                 : 1;
  unsigned SE23                 : 1;
  } __LCDSE2bits_t;

extern __at(0x0ED0) volatile __LCDSE2bits_t LCDSE2bits;

#define _SE16                   0x01
#define _SE17                   0x02
#define _SE18                   0x04
#define _SE19                   0x08
#define _SE20                   0x10
#define _SE21                   0x20
#define _SE22                   0x40
#define _SE23                   0x80

//==============================================================================


//==============================================================================
//        LCDSE3 Bits

extern __at(0x0ED1) __sfr LCDSE3;

typedef struct
  {
  unsigned SE24                 : 1;
  unsigned SE25                 : 1;
  unsigned SE26                 : 1;
  unsigned SE27                 : 1;
  unsigned SE28                 : 1;
  unsigned SE29                 : 1;
  unsigned SE30                 : 1;
  unsigned SE31                 : 1;
  } __LCDSE3bits_t;

extern __at(0x0ED1) volatile __LCDSE3bits_t LCDSE3bits;

#define _SE24                   0x01
#define _SE25                   0x02
#define _SE26                   0x04
#define _SE27                   0x08
#define _SE28                   0x10
#define _SE29                   0x20
#define _SE30                   0x40
#define _SE31                   0x80

//==============================================================================


//==============================================================================
//        LCDSE4 Bits

extern __at(0x0ED2) __sfr LCDSE4;

typedef struct
  {
  unsigned SE32                 : 1;
  unsigned SE33                 : 1;
  unsigned SE34                 : 1;
  unsigned SE35                 : 1;
  unsigned SE36                 : 1;
  unsigned SE37                 : 1;
  unsigned SE38                 : 1;
  unsigned SE39                 : 1;
  } __LCDSE4bits_t;

extern __at(0x0ED2) volatile __LCDSE4bits_t LCDSE4bits;

#define _SE32                   0x01
#define _SE33                   0x02
#define _SE34                   0x04
#define _SE35                   0x08
#define _SE36                   0x10
#define _SE37                   0x20
#define _SE38                   0x40
#define _SE39                   0x80

//==============================================================================


//==============================================================================
//        LCDSE5 Bits

extern __at(0x0ED3) __sfr LCDSE5;

typedef struct
  {
  unsigned SE40                 : 1;
  unsigned SE41                 : 1;
  unsigned SE42                 : 1;
  unsigned SE43                 : 1;
  unsigned SE44                 : 1;
  unsigned SE45                 : 1;
  unsigned SE46                 : 1;
  unsigned SE47                 : 1;
  } __LCDSE5bits_t;

