OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f95j94.h
#define _EDG2SEL0               0x04
#define _EDG2SEL1               0x08
#define _EDG2SEL2               0x10
#define _EDG2SEL3               0x20
#define _EDG2POL                0x40
#define _EDG2EN                 0x80

//==============================================================================


//==============================================================================
//        CTMUCON2 Bits

extern __at(0x0EF7) __sfr CTMUCON2;

typedef union
  {
  struct
    {
    unsigned IRNG0              : 1;
    unsigned IRNG1              : 1;
    unsigned ITRIM0             : 1;
    unsigned ITRIM1             : 1;
    unsigned ITRIM2             : 1;
    unsigned ITRIM3             : 1;
    unsigned ITRIM4             : 1;
    unsigned ITRIM5             : 1;
    };

  struct
    {
    unsigned IRNG               : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned ITRIM              : 6;
    };
  } __CTMUCON2bits_t;

extern __at(0x0EF7) volatile __CTMUCON2bits_t CTMUCON2bits;

#define _IRNG0                  0x01
#define _IRNG1                  0x02
#define _ITRIM0                 0x04
#define _ITRIM1                 0x08
#define _ITRIM2                 0x10
#define _ITRIM3                 0x20
#define _ITRIM4                 0x40
#define _ITRIM5                 0x80

//==============================================================================


//==============================================================================
//        CTMUCON1 Bits

extern __at(0x0EF8) __sfr CTMUCON1;

typedef struct
  {
  unsigned CTTRIG               : 1;
  unsigned IDISSEN              : 1;
  unsigned EDGSEQEN             : 1;
  unsigned EDGEN                : 1;
  unsigned TGEN                 : 1;
  unsigned CTMUSIDL             : 1;
  unsigned                      : 1;
  unsigned CTMUEN               : 1;
  } __CTMUCON1bits_t;

extern __at(0x0EF8) volatile __CTMUCON1bits_t CTMUCON1bits;

#define _CTTRIG                 0x01
#define _IDISSEN                0x02
#define _EDGSEQEN               0x04
#define _EDGEN                  0x08
#define _TGEN                   0x10
#define _CTMUSIDL               0x20
#define _CTMUEN                 0x80

//==============================================================================

extern __at(0x0EF9) __sfr TXREG4;
extern __at(0x0EFA) __sfr RCREG4;

//==============================================================================
//        SPBRG4 Bits

extern __at(0x0EFB) __sfr SPBRG4;

typedef struct
  {
  unsigned BRG0                 : 1;
  unsigned BRG1                 : 1;
  unsigned BRG2                 : 1;
  unsigned BRG3                 : 1;
  unsigned BRG4                 : 1;
  unsigned BRG5                 : 1;
  unsigned BRG6                 : 1;
  unsigned BRG7                 : 1;
  } __SPBRG4bits_t;

extern __at(0x0EFB) volatile __SPBRG4bits_t SPBRG4bits;

#define _SPBRG4_BRG0            0x01
#define _SPBRG4_BRG1            0x02
#define _SPBRG4_BRG2            0x04
#define _SPBRG4_BRG3            0x08
#define _SPBRG4_BRG4            0x10
#define _SPBRG4_BRG5            0x20
#define _SPBRG4_BRG6            0x40
#define _SPBRG4_BRG7            0x80

//==============================================================================


//==============================================================================
//        SPBRGH4 Bits

extern __at(0x0EFC) __sfr SPBRGH4;

typedef struct
  {
  unsigned BRG8                 : 1;
  unsigned BRG9                 : 1;
  unsigned BRG10                : 1;
  unsigned BRG11                : 1;
  unsigned BRG12                : 1;
  unsigned BRG13                : 1;
  unsigned BRG14                : 1;
  unsigned BRG15                : 1;
  } __SPBRGH4bits_t;

extern __at(0x0EFC) volatile __SPBRGH4bits_t SPBRGH4bits;

#define _SPBRGH4_BRG8           0x01
#define _SPBRGH4_BRG9           0x02
#define _SPBRGH4_BRG10          0x04
#define _SPBRGH4_BRG11          0x08
#define _SPBRGH4_BRG12          0x10
#define _SPBRGH4_BRG13          0x20
#define _SPBRGH4_BRG14          0x40
#define _SPBRGH4_BRG15          0x80

//==============================================================================


//==============================================================================
//        BAUDCON4 Bits

extern __at(0x0EFD) __sfr BAUDCON4;

typedef struct
  {
  unsigned ABDEN                : 1;
  unsigned WUE                  : 1;
  unsigned IREN                 : 1;
  unsigned BRG16                : 1;
  unsigned TXCKP                : 1;
  unsigned RXDTP                : 1;
  unsigned RCIDL                : 1;
  unsigned ABDOVF               : 1;
  } __BAUDCON4bits_t;

extern __at(0x0EFD) volatile __BAUDCON4bits_t BAUDCON4bits;

#define _BAUDCON4_ABDEN         0x01
#define _BAUDCON4_WUE           0x02
#define _BAUDCON4_IREN          0x04
#define _BAUDCON4_BRG16         0x08
#define _BAUDCON4_TXCKP         0x10
#define _BAUDCON4_RXDTP         0x20
#define _BAUDCON4_RCIDL         0x40
#define _BAUDCON4_ABDOVF        0x80

//==============================================================================


//==============================================================================
//        TXSTA4 Bits

extern __at(0x0EFE) __sfr TXSTA4;

typedef struct
  {
  unsigned TX9D                 : 1;
  unsigned TRMT                 : 1;
  unsigned BRGH                 : 1;
  unsigned SENDB                : 1;
  unsigned SYNC                 : 1;
  unsigned TXEN                 : 1;
  unsigned TX9                  : 1;
  unsigned CSRC                 : 1;
  } __TXSTA4bits_t;

extern __at(0x0EFE) volatile __TXSTA4bits_t TXSTA4bits;

#define _TXSTA4_TX9D            0x01
#define _TXSTA4_TRMT            0x02
#define _TXSTA4_BRGH            0x04
#define _TXSTA4_SENDB           0x08
#define _TXSTA4_SYNC            0x10
#define _TXSTA4_TXEN            0x20
#define _TXSTA4_TX9             0x40
#define _TXSTA4_CSRC            0x80

//==============================================================================


//==============================================================================
//        RCSTA4 Bits

extern __at(0x0EFF) __sfr RCSTA4;

typedef struct
  {
  unsigned RX9D                 : 1;
  unsigned OERR                 : 1;
  unsigned FERR                 : 1;
  unsigned ADDEN                : 1;
  unsigned CREN                 : 1;
  unsigned SREN                 : 1;
  unsigned RX9                  : 1;
  unsigned SPEN                 : 1;
  } __RCSTA4bits_t;

extern __at(0x0EFF) volatile __RCSTA4bits_t RCSTA4bits;

#define _RCSTA4_RX9D            0x01
#define _RCSTA4_OERR            0x02
#define _RCSTA4_FERR            0x04
#define _RCSTA4_ADDEN           0x08
#define _RCSTA4_CREN            0x10
#define _RCSTA4_SREN            0x20
#define _RCSTA4_RX9             0x40
#define _RCSTA4_SPEN            0x80

//==============================================================================


//==============================================================================
//        DMACON2 Bits

extern __at(0x0F00) __sfr DMACON2;

typedef union
  {
  struct
    {
    unsigned INTLVL0            : 1;
    unsigned INTLVL1            : 1;
    unsigned INTLVL2            : 1;
    unsigned INTLVL3            : 1;
    unsigned DLYCYC0            : 1;
    unsigned DLYCYC1            : 1;
    unsigned DLYCYC2            : 1;
    unsigned DLYCYC3            : 1;
    };

  struct
    {
    unsigned INTLVL             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DLYCYC             : 4;
    };
  } __DMACON2bits_t;

extern __at(0x0F00) volatile __DMACON2bits_t DMACON2bits;

