OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f95j94.h
extern __at(0x0F70) volatile __TXADDRLbits_t TXADDRLbits;

#define _TXADDR0                0x01
#define _TXADDR1                0x02
#define _TXADDR2                0x04
#define _TXADDR3                0x08
#define _TXADDR4                0x10
#define _TXADDR5                0x20
#define _TXADDR6                0x40
#define _TXADDR7                0x80

//==============================================================================


//==============================================================================
//        PORTVP Bits

extern __at(0x0F71) __sfr PORTVP;

typedef struct
  {
  unsigned RVP0                 : 1;
  unsigned RVP1                 : 1;
  unsigned RVP2                 : 1;
  unsigned RVP3                 : 1;
  unsigned RVP4                 : 1;
  unsigned RVP5                 : 1;
  unsigned RVP6                 : 1;
  unsigned RVP7                 : 1;
  } __PORTVPbits_t;

extern __at(0x0F71) volatile __PORTVPbits_t PORTVPbits;

#define _RVP0                   0x01
#define _RVP1                   0x02
#define _RVP2                   0x04
#define _RVP3                   0x08
#define _RVP4                   0x10
#define _RVP5                   0x20
#define _RVP6                   0x40
#define _RVP7                   0x80

//==============================================================================


//==============================================================================
//        LATVP Bits

extern __at(0x0F72) __sfr LATVP;

typedef struct
  {
  unsigned LATVP0               : 1;
  unsigned LATVP1               : 1;
  unsigned LATVP2               : 1;
  unsigned LATVP3               : 1;
  unsigned LATVP4               : 1;
  unsigned LATVP5               : 1;
  unsigned LATVP6               : 1;
  unsigned LATVP7               : 1;
  } __LATVPbits_t;

extern __at(0x0F72) volatile __LATVPbits_t LATVPbits;

#define _LATVP0                 0x01
#define _LATVP1                 0x02
#define _LATVP2                 0x04
#define _LATVP3                 0x08
#define _LATVP4                 0x10
#define _LATVP5                 0x20
#define _LATVP6                 0x40
#define _LATVP7                 0x80

//==============================================================================


//==============================================================================
//        TRISVP Bits

extern __at(0x0F73) __sfr TRISVP;

typedef struct
  {
  unsigned TRISVP0              : 1;
  unsigned TRISVP1              : 1;
  unsigned TRISVP2              : 1;
  unsigned TRISVP3              : 1;
  unsigned TRISVP4              : 1;
  unsigned TRISVP5              : 1;
  unsigned TRISVP6              : 1;
  unsigned TRISVP7              : 1;
  } __TRISVPbits_t;

extern __at(0x0F73) volatile __TRISVPbits_t TRISVPbits;

#define _TRISVP0                0x01
#define _TRISVP1                0x02
#define _TRISVP2                0x04
#define _TRISVP3                0x08
#define _TRISVP4                0x10
#define _TRISVP5                0x20
#define _TRISVP6                0x40
#define _TRISVP7                0x80

//==============================================================================


//==============================================================================
//        UADDR Bits

extern __at(0x0F74) __sfr UADDR;

typedef union
  {
  struct
    {
    unsigned ADDR0              : 1;
    unsigned ADDR1              : 1;
    unsigned ADDR2              : 1;
    unsigned ADDR3              : 1;
    unsigned ADDR4              : 1;
    unsigned ADDR5              : 1;
    unsigned ADDR6              : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDR               : 7;
    unsigned                    : 1;
    };
  } __UADDRbits_t;

extern __at(0x0F74) volatile __UADDRbits_t UADDRbits;

#define _ADDR0                  0x01
#define _ADDR1                  0x02
#define _ADDR2                  0x04
#define _ADDR3                  0x08
#define _ADDR4                  0x10
#define _ADDR5                  0x20
#define _ADDR6                  0x40

//==============================================================================


//==============================================================================
//        UCON Bits

extern __at(0x0F75) __sfr UCON;

typedef struct
  {
  unsigned                      : 1;
  unsigned SUSPND               : 1;
  unsigned RESUME               : 1;
  unsigned USBEN                : 1;
  unsigned PKTDIS               : 1;
  unsigned SE0                  : 1;
  unsigned PPBRST               : 1;
  unsigned                      : 1;
  } __UCONbits_t;

extern __at(0x0F75) volatile __UCONbits_t UCONbits;

#define _SUSPND                 0x02
#define _RESUME                 0x04
#define _USBEN                  0x08
#define _PKTDIS                 0x10
#define _SE0                    0x20
#define _PPBRST                 0x40

//==============================================================================


//==============================================================================
//        USTAT Bits

extern __at(0x0F76) __sfr USTAT;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned PPBI               : 1;
    unsigned DIR                : 1;
    unsigned ENDP0              : 1;
    unsigned ENDP1              : 1;
    unsigned ENDP2              : 1;
    unsigned ENDP3              : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned ENDP               : 4;
    unsigned                    : 1;
    };
  } __USTATbits_t;

extern __at(0x0F76) volatile __USTATbits_t USTATbits;

#define _PPBI                   0x02
#define _DIR                    0x04
#define _ENDP0                  0x08
#define _ENDP1                  0x10
#define _ENDP2                  0x20
#define _ENDP3                  0x40

//==============================================================================


//==============================================================================
//        UEIR Bits

extern __at(0x0F77) __sfr UEIR;

typedef struct
  {
  unsigned PIDEF                : 1;
  unsigned CRC5EF               : 1;
  unsigned CRC16EF              : 1;
  unsigned DFN8EF               : 1;
  unsigned BTOEF                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned BTSEF                : 1;
  } __UEIRbits_t;

extern __at(0x0F77) volatile __UEIRbits_t UEIRbits;

#define _PIDEF                  0x01
#define _CRC5EF                 0x02
#define _CRC16EF                0x04
#define _DFN8EF                 0x08
#define _BTOEF                  0x10
#define _BTSEF                  0x80

//==============================================================================


//==============================================================================
//        UIR Bits

extern __at(0x0F78) __sfr UIR;

typedef struct
  {
  unsigned URSTIF               : 1;
  unsigned UERRIF               : 1;
  unsigned ACTVIF               : 1;
  unsigned TRNIF                : 1;
  unsigned IDLEIF               : 1;
  unsigned STALLIF              : 1;
  unsigned SOFIF                : 1;
  unsigned                      : 1;
  } __UIRbits_t;

extern __at(0x0F78) volatile __UIRbits_t UIRbits;

#define _URSTIF                 0x01
#define _UERRIF                 0x02
#define _ACTVIF                 0x04
#define _TRNIF                  0x08
#define _IDLEIF                 0x10
#define _STALLIF                0x20
#define _SOFIF                  0x40

//==============================================================================

extern __at(0x0F79) __sfr UFRM;

//==============================================================================
//        UFRMH Bits

